# ChangeSpotElevationFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..ChangeSpotElevationFailed Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Can't change Spot Elevation to the desired value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ChangeSpotElevationFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ChangeSpotElevationFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ChangeSpotElevationFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace